import { isCardID } from "../isCardID";
/*
1、非1位数字（包括空格、空）

2、非X和x的字母

3、18位合法的身份证号

4、17位数字、19位数字

7、号码中含有特殊字符、中文、字母(除最后一位是X或x)、全角字符、空格

8、全部为空格

9、输入框不可粘贴复制汉字 ，数字超过 18位

【实例设计身份证格式验证测试用例：】


2、正确数据-输入18位身份证号且只有数字，例如130701199310302288

3、正确数据_输入18位身份证号且最后一位为X，例如52030219891209794X

4、错误数据_输入18位身份证号且最后一位为除X外的字母，例如52030219891209794Y

8、错误数据-输入数字多于18位，例如5203021989120979412

9、错误数据-身份证号中含有字母，例如52030219aaaaddd8912

10、错误数据-输入数据中含有特殊字符，例如520@#￥%&×302198912

11、错误数据-输入为空

12、错误数据-输入为空格
*/

test('isCardID : 正确数据-输入18位身份证号且只有数字，例如130701199310302288 ', () => {
  expect(isCardID("130701199310302288")).toBe(true);
});
test('isCardID : 正确数据_输入18位身份证号且最后一位为X，例如52030219891209794X ', () => {
  expect(isCardID("52030219891209794X")).toBe(true);
});

test('isCardID : 错误数据_输入18位身份证号且最后一位为除X外的字母，例如52030219891209794Y ', () => {
  expect(isCardID("52030219891209794Y")).toBe(false);
});

test('isCardID : 错误数据-输入数字少于18位，例如52030219891209794 ', () => {
  expect(isCardID("52030219891209794")).toBe(false);
});
test('isCardID : 错误数据-输入数字多于18位，例如5203021989120979412 ', () => {
  expect(isCardID("5203021989120979412")).toBe(false);
});
test('isCardID : 9、错误数据-身份证号中含有字母，例如52030219aaaaddd8912 ', () => {
  expect(isCardID("52030219aaaaddd8912")).toBe(false);
});
test('isCardID : 10、错误数据-输入数据中含有特殊字符，例如520@#￥%&×302198912 ', () => {
  expect(isCardID("520@#￥%&×302198912")).toBe(false);
});
test('isCardID : 错误数据-输入为空 ', () => {
  expect(isCardID("")).toBe(false);
});
test('isCardID : 错误数据-输入为空格 ', () => {
  expect(isCardID(" ")).toBe(false);
});
