/******************************************
 **********   严格的身份证校验   ***************
 ******************************************/
/**
 * 身份证格式严格校验
 * @author jed
 * @param { String } sId   身份证号码
 * @returns  { Boolean }
 * @example
 * // 正确数据-输入18位身份证号且只有数字，例如130701199310302288
 * isCardID("130701199310302288")
 * // => true
 *
 * // 正确数据_输入18位身份证号且最后一位为X，例如52030219891209794X
 * isCardID("52030219891209794X")
 * // => true
 *
 * // 错误数据_输入18位身份证号且最后一位为除X外的字母，例如52030219891209794Y
 * isCardID("52030219891209794Y")
 * // => false
 */
export declare const isCardID: (sId: string) => boolean;
